nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/uart_bridge/hal_uart_bridge.c
/*
 *
 *
 * Copyright 2023-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * --------------------------------------------------------------------
 *
 *        MODULE:       HAL UART BRIDGE driver
 *
 *        PURPOSE:      Hardware abstraction layer for the communication
 *        between host controller and signal board
 *
 *        COMMENTS:     -
 *
 * ------------------------------------------------------------------------*/

/* standard includes */

#include "hal_uart_bridge.h"
#include <stdio.h>
#include "fsl_lpuart.h"
#include <sys/time.h>

#if EASYEVSE
#include "EVSE_config.h"
#include "EVSE_Utils.h"
#include "EVSE_Metering.h"
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"
#endif /* EasyEVSE */

#define UART_THREAD_PRIORITY (5)

#define SIGBRD_RESP_TIMEOUT 0x10

#define SIGBRD_EVSE_COMMAND_BUFFER_SIZE 8
#define SIGBRD_EV_COMMAND_BUFFER_SIZE   4
#define SIGBRD_EVSE_MAX_TRIES_WAIT      3

#define SIGBRD_QUEUE_SIZE           2
#define SIGBRD_END_OF_MSG           '\r'
#define SIGBRD_COMMAND_START_STRING "["
#define SIGBRD_COMMAND_START        '['
#define SIGBRD_COMMAND_START_SIZE   1
#define SIGBRD_COMMAND_END          ']'
#define SIGBRD_COMMAND_END_SIZE     1
#define SIGBRD_COMMAND_SIZE         1

#if EASYEVSE
#define DBGPRINTF_DEBUG(x) configPRINTF(x)
#define DBGPRINT_INFO(x)   configPRINTF(x)
#define perror(x)          configPRINTF((error(x)))
#define DBGPRINT_ERROR(x)  configPRINTF(x)
#else
#define DBGPRINTF_DEBUG(x)
#define DBGPRINT_INFO(x)
#define perror(x)
#define DBGPRINT_ERROR(x)
#endif /* EASYEVSE */

typedef enum _lpuart_state
{
    LPUART_STATE_IDLE = 0,
    LPUART_STATE_SENDING,
    LPUART_STATE_WAITING_RESPONSE,
    LPUART_STATE_MESSAGE_SEND,
} lpuart_state_t;

typedef struct _lpuart_message_format
{
    uint32_t size;
    char *buffer_addr;
} lpuart_message_format_t;

static bool response_received      = false;
static lpuart_state_t lpuart_state = LPUART_STATE_IDLE;
static char sigbrd_ring_buffer[SIGBRD_RING_BUFFER_NUMBERS][SIGBRD_RING_BUFFER_SIZE];
static volatile uint16_t
    rx_index_sigbrd[SIGBRD_RING_BUFFER_NUMBERS]; /* Index of the memory to save new arrived data. */
static uint8_t rx_write_index_buffer, rx_read_index_buffer;
static COMMAND_UART_CODE expected_reply_code;

#if EASYEVSE
static QueueHandle_t response_receive_queue, response_receive_manager_queue;
#else
uint32_t gdwTenMilliSecTimeout;
#endif /* EASYEVSE */

struct sigbrd_state_t SigbrdRawState = {
    kPPNotDetected, kCPStateF, false, 0, 0, 0, 0x3030, 0, {'\0'}, 0.0, 0.0, 0.0,
};

static uint32_t adc_sample_size        = 0;
static uint32_t iso15118_tick_delay_ms = 0;
static bool s_init = false;

static void reset_sigbrd_state_machine()
{
    expected_reply_code = CMD_ERR;
    lpuart_state        = LPUART_STATE_IDLE;
}

static void GetADCVal(char *sigBrdRingBuffer, uint32_t *adcValPtr)
{
    static uint8_t adcBuffIndex = 0;
    int ret;

    /* Set pointer to start of receiver array */
    ret = (int)strtod(&sigBrdRingBuffer[0], NULL); /* point ptr after the decimals */

    if (adcBuffIndex >= adc_sample_size)
    {
        adcBuffIndex = 0;
    }

    if (ret == 0)
    {
        if ((sigBrdRingBuffer[0] == '0') && (sigBrdRingBuffer[1] == '0') && (sigBrdRingBuffer[2] == '0') &&
            (sigBrdRingBuffer[3] == '0') && (sigBrdRingBuffer[4] == '0'))
        {
            *(adcValPtr + adcBuffIndex) = SigbrdRawState.ADCCPValue = 0;
        }
        else
        {
            DBGPRINT_ERROR(("GetADCVal() - string to decimal error"));
        }
    }
    else if (ret > 0)
    {
        *(adcValPtr + adcBuffIndex) = SigbrdRawState.ADCCPValue = ret / 16; /* ADC value */
    }

    adcBuffIndex++;
}
/**
 * @brief Write data over UART
 *
 * @param buf buffer from where to read the data
 * @param size size of the data that needs to be written
 * @param timeout timeout for the write procedure
 * @return uint32_t number of bytes written
 */
static uint32_t nblk_write_uart(const char *const buf, uint32_t size, const struct timeval *timeout)
{
    response_received = false;

    for (int i = 0; i < size; i++)
    {
        LPUART_WriteByte(SIGBRD_LPUART, buf[i]);
        if (buf[i] == SIGBRD_END_OF_MSG)
        {
            lpuart_state = LPUART_STATE_WAITING_RESPONSE;
        }

        /* Wait for UART Outputs to complete */
        while (!(LPUART_GetStatusFlags(SIGBRD_LPUART) & kLPUART_TxDataRegEmptyFlag))
        {
        }
    }

    /* TODO Might be worth adding wait for ACK */
    return size;
}

/**
 * @brief Read the UART
 *
 * @param buf buffer in which to read the data
 * @param size Size of the buffer
 * @param timeout timeout
 * @return uint32_t number of byte read
 */
static uint32_t nblk_read_uart(void *buf, uint32_t size, struct timeval *timeout)
{
    /* Wait for event sigbrd which is set by the SIGBRD_LPUART_IRQHandler only when full packet received from Meter */
    uint32_t timeoutms              = (timeout->tv_sec * 1000000 + timeout->tv_usec) / 1000;
    lpuart_message_format_t message = {0};
    uint32_t bytes_rcv              = 0;
#if EASYEVSE
    xQueueReceive(response_receive_queue, &message, pdMS_TO_TICKS(timeoutms));
#else
    gdwTenMilliSecTimeout = timeoutms / 10; // 10*10 = 100 msec timeout
    while ((!response_received) && (gdwTenMilliSecTimeout))
    {
    }
    if (response_received)
    {
        message.buffer_addr = sigbrd_ring_buffer[rx_read_index_buffer];
        message.size        = rx_index_sigbrd[rx_read_index_buffer];
        rx_read_index_buffer++;
    }
#endif /* EASYEVSE */

    if (response_received == true)
    {
        bytes_rcv = message.size;
        if (size < bytes_rcv)
        {
            DBGPRINT_ERROR(("%s Too many bytes rcv %d", __FUNCTION__, bytes_rcv));
            bytes_rcv = size;
        }

        memcpy(buf, message.buffer_addr, bytes_rcv);
    }

    return bytes_rcv;
}

/**
 * @brief Get the reply code object
 *
 * @param message_buffer message reply from sigboard
 * @return COMMAND_UART_CODE
 */
static COMMAND_UART_CODE get_reply_code(char *message_buffer)
{
    char cmd      = CMD_ERR;
    uint16_t size = 0;
    /*
     * Some commands in previous versions of the SIGBRD LPC55
     * firmware replied with a null byte instead of ASCII '0'.
     * Protect parser by forcing ASCII.
     */
    if (message_buffer[0] == '\0')
    {
        message_buffer[0] = '0';
    }

    size = strlen(message_buffer);

    for (uint32_t i = 0; i < size; i++)
    {
        if (message_buffer[i] == SIGBRD_COMMAND_START)
        {
            if (((i < (size - SIGBRD_COMMAND_SIZE - SIGBRD_COMMAND_START_SIZE)) &&
                 (message_buffer[i + SIGBRD_COMMAND_START_SIZE + SIGBRD_COMMAND_SIZE] == SIGBRD_COMMAND_END)))
            {
                if ((cmd >= METER_ALL) && (cmd <= METER_LAST))
                {
                    /* we found another cmd related to Meter this means METER_ALL*/
                    cmd = METER_ALL;
                    break;
                }
                cmd = message_buffer[i + SIGBRD_COMMAND_START_SIZE];
            }
        }
    }

    return cmd;
}

/**
 * @brief Parse the reply in order to get the values from the message_buffer
 *
 * @param message_buffer message reply from sigboard
 * @param value_returned where to store the parse value.
 * @return COMMAND_UART_CODE
 */
static COMMAND_UART_CODE parse_reply(char *message_buffer, uint32_t *value_returned)
{
    char sigboardRing[SIGBRD_RING_BUFFER_SIZE];
    char *value = NULL;
    char cmd    = CMD_ERR;
    int i_resp  = -1;

    cmd = get_reply_code(message_buffer);

    /* strtok() is destructive, back up the read buffer */
    memcpy(sigboardRing, message_buffer, SIGBRD_RING_BUFFER_SIZE);

    value = strtok(sigboardRing, SIGBRD_COMMAND_START_STRING); /*Looking for the value before [*/

