nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/uart_bridge/hal_uart_bridge.c
    if (value == NULL)
    {
        return CMD_ERR;
    }

    switch (cmd)
    {
        case ALL_STATES:
        case PP_STATE:
        case CP_STATE:
        case GFCI_STATE:
        case ADC_CP_VALUE:
        case ADC_PP_VALUE:
        case GET_PWM_DUTY:
        case CP_RESISTOR_VALUE:
        case PWM_DUTY_PER_MILLI:
        case CLOSE_RELAY:
        case OPEN_RELAY:
        case SET_CP:
            i_resp = atoi(value);
            break;
        case HWVERSION:
            i_resp = *value;
            break;
        case VERSION:
            strcpy(SigbrdRawState.version, value);
            break;
    }

    switch (cmd)
    {
        case HWVERSION:
            if (value_returned != NULL)
            {
                *value_returned = i_resp;
            }
            break;
        case PP_STATE:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - The Proximity Pilot State is %d \r\n", i_resp));
            SigbrdRawState.PPState = (kPPState)i_resp;

            if (value_returned != NULL)
            {
                *value_returned = SigbrdRawState.PPState;
            }
            break;
        case CP_STATE:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - The Control Pilot State is %d \r\n", i_resp));
            SigbrdRawState.CPState = (kCPState)i_resp;
            if (value_returned != NULL)
            {
                *value_returned = SigbrdRawState.CPState;
            }
            break;
        case GFCI_STATE:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - The GFCI State is %d \r\n", i_resp));
            SigbrdRawState.GFCIState = (uint16_t)i_resp;
            if (value_returned != NULL)
            {
                *value_returned = SigbrdRawState.GFCIState;
            }
            break;
        case ADC_CP_VALUE:
            if (value_returned != NULL)
            {
                *value_returned = i_resp;
                // DBGPRINTF_DEBUG (("[UART_BRIDGE] - The ADC Value of Control Pilot is %d \n", i_resp));
                GetADCVal(&sigboardRing[0], value_returned);
            }
            else
            {
                DBGPRINTF_DEBUG(("Response code 0x%x \r\n", cmd));
            }
            break;
        case ADC_PP_VALUE:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - The ADC Value of Proximity Pilot is %d \r\n", i_resp));
            SigbrdRawState.ADCPPValue = (uint32_t)i_resp;
            if (value_returned != NULL)
            {
                *value_returned = SigbrdRawState.ADCPPValue;
            }
            break;
        case GET_PWM_DUTY:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - Get PWM duty cycle is %d \r\n", i_resp));
            SigbrdRawState.PWMDutyCycle = (uint32_t)i_resp;
            if (value_returned != NULL)
            {
                *value_returned = SigbrdRawState.PWMDutyCycle;
            }
            break;
        case CP_RESISTOR_VALUE:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - The CP_RESISTOR_VALUE is %d \r\n", i_resp));
            if (value_returned != NULL)
            {
                *value_returned = i_resp;
            }
            break;
        case PWM_DUTY_PER_MILLI:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - PWM_DUTY_PER_MILLI is: %s 0x%x \r\n", value, cmd));
            break;
        case CLOSE_RELAY:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - Close Relay %d \r\n", i_resp));
            break;
        case OPEN_RELAY:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - Open Relay %d \r\n", i_resp));
            break;
        case SET_CP:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - SET_CP is: %d \r\n", i_resp));
            break;
        case VERSION:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - Version %s \r\n", value));
            break;
#if ((EASYEVSE == 1) && (ENABLE_METER == 1))
            /* TODO */
        case METER_ALL:
            /* Do nothing */
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - METER_ALL \r\n"));
            break;
        case METER_CURRENT:
            //   DBGPRINTF_DEBUG (("[UART_BRIDGE] - METER_CURRENT \r\n"));
            if (value_returned != NULL)
            {
                *value_returned = SigbrdRawState.current;
            }

            break;
        case METER_VOLTAGE:
            //    DBGPRINTF_DEBUG (("[UART_BRIDGE] - METER_VOLTAGE \r\n"));
            if (value_returned != NULL)
            {
                *value_returned = SigbrdRawState.voltage;
            }
            break;
        case METER_POWER:
            //    DBGPRINTF_DEBUG (("[UART_BRIDGE] - METER_POWER \r\n"));
            if (value_returned != NULL)
            {
                *value_returned = SigbrdRawState.power;
            }
            break;
        case METER_STATE:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - METER_State \r\n"));
            break;
#endif /* EASYEVSE */
        case CMD_UNKNOWN:
            DBGPRINTF_DEBUG(("[UART_BRIDGE] - WARNING: error response received \r\n"));
            break;
        default:
            // Log event
            DBGPRINTF_DEBUG(("[UART_BRIDGE] Unexpected reply: \"%s\" \r\n", sigboardRing));
            break;
    }
    /*
     * TODO: How to handle ALL_STATE and METER_ALL commands from
     * both the parsing perspective (easy) and the value returned
     * perspective (hard)?
     */

    return cmd;
}

static void Init_SigBrd_Uart(void)
{
    lpuart_config_t uart_config;

    /* Set up Meter UART
     * config.baudRate_Bps = 115200U;
     * config.parityMode = kLPUART_ParityDisabled;
     * config.stopBitCount = kLPUART_OneStopBit;
     * config.txFifoWatermark = 0;
     * config.rxFifoWatermark = 0;
     * config.enableTx = false;
     * config.enableRx = false;
     */
    LPUART_GetDefaultConfig(&uart_config);
    uart_config.baudRate_Bps = 115200U;
    uart_config.enableTx     = true;
    uart_config.enableRx     = true;
    LPUART_Init(SIGBRD_LPUART, &uart_config, SIGBRD_LPUART_CLK_FREQ);
    /* Enable on RX interrupt. */
    LPUART_EnableInterrupts(SIGBRD_LPUART, kLPUART_RxDataRegFullInterruptEnable | kLPUART_RxOverrunInterruptEnable);
    NVIC_SetPriority(SIGBRD_LPUART_IRQn, 7);
    NVIC_ClearPendingIRQ(SIGBRD_LPUART_IRQn);
    EnableIRQ(SIGBRD_LPUART_IRQn);
}

