nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/uart_bridge/hal_uart_bridge.c
#if (ENABLE_SIGBOARD && ((SIGBRD == SIGBRD2X) || (SIGBRD == HPGP)))
void SIGBRD_LPUART_IRQHandler(void)
{
    volatile uint32_t uart_status;

    char *readBuffer = sigbrd_ring_buffer[rx_write_index_buffer];

    uart_status = LPUART_GetStatusFlags(SIGBRD_LPUART);

    if ((kLPUART_RxOverrunFlag)&uart_status)
    {
        /* clear OR */
        LPUART_ClearStatusFlags(SIGBRD_LPUART, kLPUART_RxOverrunFlag);
    }

    /* Check if new data arrived. */
    if ((kLPUART_RxDataRegFullFlag)&uart_status)
    {
        char data = LPUART_ReadByte(SIGBRD_LPUART);
        if (rx_index_sigbrd[rx_write_index_buffer] < SIGBRD_RING_BUFFER_SIZE)
        {
            readBuffer[rx_index_sigbrd[rx_write_index_buffer]] = data;

            rx_index_sigbrd[rx_write_index_buffer]++;
            if (rx_index_sigbrd[rx_write_index_buffer] == SIGBRD_RING_BUFFER_SIZE)
            {
                /* restrict sequence of rxIndex to 0..SIGBRD_RING_BUFFER_SIZE */
                rx_index_sigbrd[rx_write_index_buffer] = 0;
            }
            else if (data == SIGBRD_END_OF_MSG)
            {
                /* set NULL character at end of data for str function handling*/
                readBuffer[rx_index_sigbrd[rx_write_index_buffer]] = 0;

                if (lpuart_state == LPUART_STATE_WAITING_RESPONSE)
                {
                    /* Set event flag 0 to wakeup meter_refresh thread.  */
                    response_received    = true;
                    rx_read_index_buffer = rx_write_index_buffer;
                }

#if EASYEVSE
                BaseType_t xHigherPriorityTaskWoken = pdFALSE;
                lpuart_message_format_t message     = {.buffer_addr = sigbrd_ring_buffer[rx_write_index_buffer],
                                                       .size        = rx_index_sigbrd[rx_write_index_buffer]};

                xQueueSendFromISR(response_receive_manager_queue, &message, &xHigherPriorityTaskWoken);
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
#endif /* EASYEVSE */

                rx_write_index_buffer = (rx_write_index_buffer + 1) % SIGBRD_RING_BUFFER_NUMBERS;
                if (rx_index_sigbrd[rx_write_index_buffer])
                {
                    rx_index_sigbrd[rx_write_index_buffer] = 0;
                }
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENABLE_SIGBOARD && ((SIGBRD == SIGBRD2X) || (SIGBRD == HPGP)) */

void SIGBRD_GetADCVal(uint32_t *adcValPtr)
{
    if (SIGBRD_EVSE_UARTCommsProcess(ADC_CP_VALUE, 0, adcValPtr))
        return;

#if DEBUG
    static uint32_t debug_display = 1;
    if (debug_display == 0)
    {
        DBGPRINTF_DEBUG(("Print ADC last value: %d", SigbrdRawState.ADCCPValue * 16));
        if (CP_READ_TIMEOUT > iso15118_tick_delay_ms)
        {
            debug_display = 1000 / CP_READ_TIMEOUT;
        }
        else
        {
            debug_display = 1000 / iso15118_tick_delay_ms;
        }
    }

    debug_display--;
#endif /* DEBUG */
}

void SIGBRD_SetPWMDutyInPercent(uint16_t dutyCycle)
{
    SIGBRD_SetPWMDutyInMilli(dutyCycle * 10);
}

void SIGBRD_SetPWMDutyInMilli(uint16_t dutyCycle)
{
    static uint16_t set_dutyVal_last = 0;

    DBGPRINT_ERROR(("SIGBRD_SetPWMDutyInMilli %d", dutyCycle));
    if (dutyCycle == set_dutyVal_last)
    {
        return;
    }
    else
    {
        set_dutyVal_last = dutyCycle;
    }

    SIGBRD_EVSE_UARTCommsProcess(PWM_DUTY_PER_MILLI, dutyCycle, NULL);
}

void SIGBRD_SetCPResistorValue(kCPResistor gpioNumber, kCPResistorState gpioState)
{
    uint16_t value_resistor = 0;

    if (gpioNumber == kCPEVResistor_270R)
    {
    }
    else if (gpioNumber == kCPEVResistor_1K3)
    {
        value_resistor = 0x3130 | gpioState;
    }

    SIGBRD_EV_UARTCommsProcess(SET_CP, value_resistor, NULL);
}

/*******************************************************************************
 * SIGBRD_EVSE_UARTCommsProcess(char command_code, uint32_t value_transmitted,
 *                             uint32_t *value_returned)
 * DESCRIPTION:
 * char command_code = UART Code for the sigboard and meter command.
 * uint32_t value_transmitted = Value to be transmited code+value
 * uint32_t *value_returned = Response data from the sigboard
 * RETURNS:
 * None
 ******************************************************************************/
int SIGBRD_EVSE_UARTCommsProcess(char command_code, uint16_t value_transmitted, uint32_t *value_returned)
{
    int status             = 0;
    struct timeval timeout = {0, 20000};
    int len                = 0;
    char message_rcv[SIGBRD_RING_BUFFER_SIZE];
    char command[SIGBRD_EVSE_COMMAND_BUFFER_SIZE] = {' ', ' ',' ',' ', ' ', ' ', ' ', SIGBRD_END_OF_MSG};
    COMMAND_UART_CODE reply_code                  = CMD_ERR;

    uint8_t bSize_command = 0;
    uint8_t bWait_tries   = 0;
 
    if (s_init == false)
    {
        return -1;
    }

    memset(message_rcv, 0, SIGBRD_RING_BUFFER_SIZE);

    command[bSize_command++] = command_code;
    switch (command_code)
    {
        case CLOSE_RELAY:
        case OPEN_RELAY:
            /* Closing and opening relay is a costing operation */
            timeout.tv_usec = 40000;
        case ALL_STATES:
        case PP_STATE:
        case CP_STATE:
        case GFCI_STATE:
        case ADC_CP_VALUE:
        case ADC_PP_VALUE:
        case CP_RESISTOR_VALUE:
        case METER_ALL:
        case METER_CURRENT:
        case METER_VOLTAGE:
        case METER_POWER:
        case METER_STATE:
        case METER_Q:
        case METER_S:
        case HWVERSION:
        case VERSION:
            /* Get parameters*/
            command[bSize_command++] = SIGBRD_END_OF_MSG;
            break;
        case PWM_DUTY_PER_MILLI:
            /* Set PWM duty cycle Value */
            bSize_command += sprintf(&command[1], "%05d%c", value_transmitted, SIGBRD_END_OF_MSG);
            SigbrdRawState.PWMDutyPerMilli = value_transmitted;
            break;
        default:
            // Log event
            DBGPRINT_ERROR(("SIGBRD - Command error \n\r"));
            return -2;
            break;
    }

