nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/uart_bridge/hal_uart_bridge.c
#if EASYEVSE
    EVSE_LPUART_GetMutex(EVSE_LPUART_GetInstance(SIGBRD_LPUART));
#endif /* EASYEVSE */

    /* send command to SIG-BRDX */

    lpuart_state        = LPUART_STATE_SENDING;
    expected_reply_code = command_code;

    len = nblk_write_uart(command, bSize_command, &timeout);

    if (len < bSize_command)
    {
        /* Failed to write */
        DBGPRINT_ERROR(("SIGBRD_EVSE_UARTCommsProcess() - failed to write %d", len));
        status = -1;
        goto exit_uart_send;
    }

    while ((reply_code != command_code) && (bWait_tries < SIGBRD_EVSE_MAX_TRIES_WAIT))
    {
        len = nblk_read_uart(message_rcv, sizeof(message_rcv), &timeout);

        if (len <= 0)
        {
            DBGPRINT_ERROR(("SIGBRD_EVSE_UARTCommsProcess() - empty read or select timeout"));
            bWait_tries++;
        }
        else
        {
            reply_code = parse_reply(message_rcv, value_returned);
        }
    }
    if (bWait_tries == SIGBRD_EVSE_MAX_TRIES_WAIT)
    {
        status = -1;
        DBGPRINT_ERROR(
            ("SIGBRD_EVSE_UARTCommsProcess() - failed to receive message [command code: %c]", expected_reply_code));
    }
    else
    {
        while (lpuart_state != LPUART_STATE_MESSAGE_SEND)
        {
            vTaskDelay(1);
        }
    }
exit_uart_send:
    reset_sigbrd_state_machine();
#if EASYEVSE
    EVSE_LPUART_PostMutex(EVSE_LPUART_GetInstance(SIGBRD_LPUART));
#endif /* EASYEVSE */
    return status;
}

void SIGBRD_GetPWMDutyInPercent(uint16_t *dutyVal)
{
    uint16_t dutyVal_Milli = 0;

    if (dutyVal == NULL)
    {
        return;
    }

    SIGBRD_GetPWMDutyInMilli(&dutyVal_Milli);
    *dutyVal = dutyVal_Milli / 10;
}

void SIGBRD_GetPWMDutyInMilli(uint16_t *dutyVal)
{
    static uint8_t get_dutyVal_count = 0;

    if (dutyVal == NULL)
    {
        return;
    }

    if (get_dutyVal_count == 0)
    {
        if (SIGBRD_EV_UARTCommsProcess(GET_PWM_DUTY, 0, &SigbrdRawState.PWMDutyCycle))
            return;
    }

    get_dutyVal_count++;

    if (SigbrdRawState.PWMDutyCycle < 0xFFFF)
    {
        *dutyVal = SigbrdRawState.PWMDutyCycle;
    }
    else
    {
        *dutyVal = 0xFFFF;
    }

    if (get_dutyVal_count == 10)
    {
        get_dutyVal_count = 0;
    }
}

void SIGBRD_GetSWVersion(uint32_t *sw_version_major, uint32_t *sw_version_minor, uint32_t *sw_version_hotfix)
{
    if ((sw_version_major == NULL) || (sw_version_minor == NULL) || (sw_version_hotfix == NULL))
    {
        return;
    }

#ifndef EASYEVSE_EV
    SIGBRD_EVSE_UARTCommsProcess(VERSION, 0, NULL);
#else
    SIGBRD_EV_UARTCommsProcess(VERSION, 0, NULL);
#endif

    *sw_version_major  = -1;
    *sw_version_minor  = -1;
    *sw_version_hotfix = -1;

    uint8_t last_parsing_element_index = 0;
    for (uint8_t i = 0; i < SIGBRD_RING_BUFFER_SIZE; i++)
    {
        if (SigbrdRawState.version[i] == '.')
        {
            SigbrdRawState.version[i] = '\0';

            uint32_t version           = atoi(&SigbrdRawState.version[last_parsing_element_index]);
            last_parsing_element_index = i + 1;

            if (*sw_version_major == -1)
            {
                *sw_version_major = version;
            }
            else if (*sw_version_minor == -1)
            {
                *sw_version_minor = version;
            }
        }
        else if (SigbrdRawState.version[i] == '\0')
        {
            uint32_t version = atoi(&SigbrdRawState.version[last_parsing_element_index]);
            if (*sw_version_hotfix == -1)
            {
                *sw_version_hotfix = version;
            }
            break;
        }
    }
}

void SIGBRD_GetHWVersion(uint32_t *hw_version)
{
    if (hw_version == NULL)
        return;

    *hw_version = INVALID_SIGBOARD_HW_VERSION;

#ifndef EASYEVSE_EV
    SIGBRD_EVSE_UARTCommsProcess(HWVERSION, 0, hw_version);
#else
    SIGBRD_EV_UARTCommsProcess(HWVERSION, 0, hw_version);
#endif
}

void SIGBRD_GetCPResistorValue(kCPResistor gpioNumber, kCPResistorState *gpioState)
{
    char resistor_number = '0';

    if (gpioState == NULL)
    {
        return;
    }

    if (gpioNumber == kCPEVResistor_270R)
    {
        resistor_number = '0'; /*  270 Ohm */
        *gpioState      = 0;
    }
    else if (gpioNumber == kCPEVResistor_1K3)
    {
        resistor_number = '1'; /* 1.3k Ohm */
        if (SIGBRD_EV_UARTCommsProcess(CP_RESISTOR_VALUE, (uint16_t)resistor_number, (uint32_t *)gpioState))
            return;
    }

    if (resistor_number == '0')
    {
        SigbrdRawState.CPResistor = (*gpioState << 8)                       /* 270 Ohm read from Sigboard */
                                    | (SigbrdRawState.CPResistor & 0x30ff); /* 1.3k Ohm cached value       */
    }
    else if (resistor_number == '1')
    {
        SigbrdRawState.CPResistor = (SigbrdRawState.CPResistor & 0xff30) /* 270 Ohm cached value       */
                                    | *gpioState;                        /* 1.3k Ohm read from Sigboard */
    }
}

/*******************************************************************************
 * SIGBRD_EV_UARTCommsProcess(char command_code, uint16_t value_resistor,
 * uint32_t *value_resp)
 * DESCRIPTION:
 * char command_code = UART Code for the EV Sigboard and meter command.
 * uint16_t value_resistor = Resistor 270 Ohms = 0 or 1.3K Ohms = 1
 * uint32_t *value_resp = Resistor State 1 is ON and 0 is OFF
 * RETURNS:
 * status of UART transmission
 ******************************************************************************/
int SIGBRD_EV_UARTCommsProcess(char command_code, uint16_t value_transmitted, uint32_t *value_returned)
{
    int status = 0;
    char message_rcv[SIGBRD_RING_BUFFER_SIZE];
    char command[SIGBRD_EV_COMMAND_BUFFER_SIZE] = {' ', ' ', ' ', SIGBRD_END_OF_MSG};
    struct timeval timeout                      = {0, 20000};
    int len                                     = 0;

    COMMAND_UART_CODE reply_code = CMD_ERR;

    uint8_t bSize_command = 0;
    uint8_t bWait_tries   = 0;

    if (s_init == false)
    {
        return -1;
    }
    memset(message_rcv, 0, SIGBRD_RING_BUFFER_SIZE); /*clear message_buffer before read*/

    switch (command_code)
    {
        case ALL_STATES:
        case PP_STATE:
        case GET_PWM_DUTY:
        case HWVERSION:
        case VERSION:
            /* Get parameters*/
            command[1]    = SIGBRD_END_OF_MSG;
            bSize_command = 2;
            break;
        case CP_RESISTOR_VALUE:
            /* Get parameters*/
            command[1]    = (char)value_transmitted;
            command[2]    = SIGBRD_END_OF_MSG;
            bSize_command = 3;
            break;
        case SET_CP:
            /* Set Control Pilot Resistor */
            command[1]                = (char)(value_transmitted >> 8);
            command[2]                = (char)(value_transmitted & 0x00FF);
            command[3]                = SIGBRD_END_OF_MSG;
            bSize_command             = 4;
            SigbrdRawState.CPResistor = value_transmitted;
            break;
        default:
            // Log event
            return -2;
            break;
    }

