nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/uart_bridge/hal_uart_bridge.c
    command[0] = command_code;

#if EASYEVSE
    EVSE_LPUART_GetMutex(EVSE_LPUART_GetInstance(SIGBRD_LPUART));
#endif /* EASYEVSE */

    lpuart_state        = LPUART_STATE_SENDING;
    expected_reply_code = command_code;

    len = nblk_write_uart(command, bSize_command, &timeout);

    lpuart_state = LPUART_STATE_WAITING_RESPONSE;

    if (len < bSize_command)
    {
        /* Failed to write */
        DBGPRINT_ERROR(("SIGBRD_EV_UARTCommsProcess() - failed to write %d", len));
        status = -1;
        goto exit_uart_send;
    }

    while ((reply_code != command_code) && (bWait_tries < SIGBRD_EVSE_MAX_TRIES_WAIT))
    {
        len = nblk_read_uart(message_rcv, sizeof(message_rcv), &timeout);
        if (len <= 0)
        {
            DBGPRINT_ERROR(("SIGBRD_EV_UARTCommsProcess() - empty read or select timeout"));
            bWait_tries++;
        }
        else
        {
            reply_code = parse_reply(message_rcv, value_returned);
        }
    }

    if (bWait_tries == SIGBRD_EVSE_MAX_TRIES_WAIT)
    {
        status = -1;
        DBGPRINT_ERROR(
            ("SIGBRD_EV_UARTCommsProcess() - failed to receive message [command code: %c]", expected_reply_code));
    }
    else
    {
        while (lpuart_state != LPUART_STATE_MESSAGE_SEND)
        {
            vTaskDelay(1);
        }
    }

exit_uart_send:
    reset_sigbrd_state_machine();
#if EASYEVSE
    EVSE_LPUART_PostMutex(EVSE_LPUART_GetInstance(SIGBRD_LPUART));
#endif /* EASYEVSE */
    return status;
}

#if EASYEVSE
static void bridge_manager_task(void *pvParameters)
{
    lpuart_message_format_t message = {0};

    while (1)
    {
        xQueueReceive(response_receive_manager_queue, &message, portMAX_DELAY);

        COMMAND_UART_CODE reply_code = get_reply_code(message.buffer_addr);

        if ((lpuart_state == LPUART_STATE_WAITING_RESPONSE) && (reply_code == expected_reply_code))
        {
            if (xQueueSend(response_receive_queue, &message, 0) == pdPASS)
            {
                lpuart_state = LPUART_STATE_MESSAGE_SEND;
            }
            else
            {
                DBGPRINT_ERROR(("Failed to put message in the RCV queue"));
            }
        }
        else
        {
            /* Async */
            parse_reply(message.buffer_addr, NULL);
        }
    }
}
#endif /* EASYEVSE */

void SIGBRD_SetChargingProtocol_TickDelayMs(uint32_t delay)
{
    iso15118_tick_delay_ms = delay;
}

void SIGBRD_UART_BridgeEntry(void)
{
    if (s_init == true)
    {
        return;
    }

    reset_sigbrd_state_machine();
#if EASYEVSE
    EVSE_LPUART_InitMutex(EVSE_LPUART_GetInstance(SIGBRD_LPUART));
    /* Attempt to create a semaphore. */
    response_receive_queue         = xQueueCreate(SIGBRD_QUEUE_SIZE, sizeof(lpuart_message_format_t));
    response_receive_manager_queue = xQueueCreate(SIGBRD_QUEUE_SIZE, sizeof(lpuart_message_format_t));

    if ((response_receive_queue == NULL) || (response_receive_manager_queue == NULL))
    {
        while (1)
            ;
    }

    if (xTaskCreate(bridge_manager_task, "Bridge_Manager", APP_BRIDGE_MANAGER_STACK_SIZE, NULL,
                    APP_BRIDGE_MANAGER_PRIORITY, NULL) != pdPASS)
    {
        while (1)
            ;
    }
#endif /* EASYEVSE */

    Init_SigBrd_Uart();
    s_init = true;
}
